In [92]:
import pyodbc
import pandas as pd

server = "DESKTOP-UI99KET\KLEBERSQL"
database = "SQL_DB_1"

In [94]:
 conn = pyodbc.connect( 'Driver={SQL Server};Server='+server+';Database='+database+';Trusted_Connection= yes;')

In [99]:
sql = "select nome, data_nascimento  from ALUNOS"

In [100]:
dados = pd.read_sql(sql, conn)

In [101]:
dados.head()

                                 nome data_nascimento
0                  Alan Manzoni Alves      1989-09-04
1  Alessandro Henrique Peres Porfirio      1989-10-04
2                   Gabriela Carolina      1995-03-23
3                       Gabriela Pina      1990-04-05
4                     Gabriela Garcia      1996-03-25

In [119]:
dados["data_nascimento"].value_counts()

1992-04-09    4
1991-06-11    3
1992-11-19    3
1991-10-09    3
1991-03-08    3
             ..
1994-10-15    1
1995-05-04    1
2001-01-03    1
1995-06-01    1
1990-04-05    1
Name: data_nascimento, Length: 569, dtype: int64

In [121]:
sql = "select * from ALUNOSXTURMAS"

In [122]:
dados2 = pd.read_sql(sql, conn)

In [123]:
dados2.head()

,id_turma,id_aluno,valor,valor_desconto,data_cadastro,login_cadastro
0,10,237,125.0,0.0,2020-03-02 00:07:41,KLB_M
1,10,350,125.0,0.0,2020-03-02 00:07:41,KLB_M
2,10,426,100.0,0.2,2020-03-02 00:07:41,KLB_M
3,10,194,100.0,0.2,2020-03-02 00:07:41,KLB_M
4,10,436,100.0,0.2,2020-03-02 00:07:41,KLB_M

In [125]:
import matplotlib as plt